let handler = async (m, { conn }) => {
    let user = global.db.data.users[m.sender];
    let name = conn.getName(m.sender);
    let taguser = '@' + m.sender.split("@s.whatsapp.net")[0];
    let message = `*〄━╼⦿┄╏⦁〔﷽〕⦁╏┄⦿╼━〄*

          *☬╎𓆩 اســـتـــمـــاࢪة الـــدخـــول 𓆪╎☬*

*〄━━━╼⦿┄⦁╏🧚🏼‍♂️╏⦁┄⦿╾━━━〄*

*❐ اللــ🪪ــقـب ~➻【】➻~*

*❐ الإنـــ🐉ــمـي ~➻【】➻~*

*❐ ذكـر/انثـى 🚻 ~➻【】➻~*

*❐ صورة📸 ~➻【-】➻~*

*❐ مـن طـ🎐ـࢪف ~➻【】➻~*

*〄━━━╼⦿┄⦁╏🧚🏼‍♂️╏⦁┄⦿╾━━━〄*

*❶ ➻ مـمـنـوع ولـد يختاࢪ لقب بـنـت*
*او الـعكس ~┊🚯◡̈⃝〕~*
*❷ ➻ مـمـنـوع الـسـوالـف ~┊🚯◡̈⃝〕~*
*❸ ➻ مـمـنـوع القاب الـ 18+ ~┊🚯◡̈⃝〕~*
*❹ ➻ مـمـنـوع السـب و الـشـتـم ~┊🚯◡̈⃝〕~*
*❺ ➻ مـمـنـوع الـࢪوابط ~┊🚯◡̈⃝〕~*

*⟣⦁━♅━⦁⟢ ~‹❲~ ملاحضات ~❳›~ ⟣⦁━♅━⦁⟢*

*⸎ يلزم اختيار القاب تابعة لهذي الفئات ⸎*
*✥⟢ انـمي ⟣✥*
*✥⟢ مانـجا ⟣✥*
*✥⟢ مانـهوا ⟣✥*
*~₪ تنـبية┊ النقابة مختلطة  ₪~*

*〄━━━╼⦿┄⦁╏🕸╏⦁┄⦿╾━━━〄*

*~تــ✍︎ــوقــيــع اداࢪة┊📜┊↯:~*
   *~〘☬╎𝑺𝒂𝒔𝒖𝒌𝒆 𝑩𝒐𝒕╎☬〙~*

*〄━━━╼⦿┄⦁╏🕸╏⦁┄⦿╾━━━〄*`;


    conn.sendFile(m.chat, 'https://telegra.ph/file/aa40589f99c1da70a74ca.jpg', 'image.jpg', message, m);
};

handler.customPrefix = /^(رونين|استماره|الاستماره)$/i;
handler.command = new RegExp;

export default handler;